In [0]:
#!pip3 install pandas  # To install a library in JUPYTER NOTEBOOK

In [0]:
import pandas as pd

In [0]:
#Reading data from a CSV

df= pd.read_csv('com.csv')  # stored in a variable df. because this is called DataFrame

# df1=pd.read_csv('http://www......')   # Fetches the data from the INTERNET as well
# df1.info()

In [0]:
# Viewing Data Structure
df.info()

In [0]:
# To print all the data
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [0]:
df.head(3)  # Fetches TOP 3 rows

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [0]:
# To Fetch Particular Column

df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [0]:
print(df['Salary'].max())   # Fetches the maximum value from the column SALARY
print(df['Salary'].min())   # Fetches the Minimum value from the column
print(df['Salary'].sum())   # Calculates the sum of column
print(df['Salary'].mean())   # Calculates the mean value of column

250
50
750
125.0

In [0]:
#  For Selecting rows and columns 

df.iloc[0:,0:2]       #  iloc= Index Location. Same as NUMPY..  iloc[row range,column range]
# df.iloc[0:,[0,3]]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [0]:
print(type(df.values))   # .values convert the dataframe to numpy type.
print(type(df))

<class 'numpy.ndarray'>
<class 'pandas.core.frame.DataFrame'>